In [3]:
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv("../data/mapa1985.csv", sep=",")

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 881280 entries, 0 to 881279
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   lat     881280 non-null  float64
 1   lon     881280 non-null  float64
 2   valor   881280 non-null  int64
dtypes: float64(2), int64(1)
memory usage: 20.2 MB

In [9]:
df.groupby('valor').count()

          lat     lon
valor
-9999  519995  519995
 1      28431   28431
 2       1592    1592
 3      44299   44299
 4      96949   96949
 6        289     289
 7        505     505
 8     178951  178951
 9       8806    8806
 11      1463    1463